{
  "slug": "banana-bread",
  "name": "Banana Bread",
  "description": "This banana bread is soft, moist, and just the right amount of sweet — the kind of bake that fills your kitchen with cozy aromas and brings everyone to the table. Whether it's breakfast, dessert, or a little afternoon comfort, this loaf never disappoints.",
  "credit": "Recipe originally by Sally McKenney of Sally’s Baking Addiction.",
  "imageUrl": "assets/images/bread/banana-bread.png",
  "categories": ["bread"],
  "flavors": ["fruity"],
  "occasion": [],
  "prepTime": "10 minutes",
  "cookTime": "1 hour",
  "totalTime": "3 hours",
  "yield": "1 loaf",
  "ingredientSections": [
    {
      "items": [
        { "name": "2 cups (250g) all-purpose flour" },
        { "name": "1 tsp baking soda" },
        { "name": "1/4 tsp salt" },
        { "name": "1/2 tsp ground cinnamon" },
        { "name": "1/2 cup (8T; 113g) unsalted butter, softened to room temp." },
        { "name": "3/4 cup (150g) packed light or dark brown sugar" },
        { "name": "2 large eggs at room temp." },
        { "name": "1/3 cup (80g) plain yogurt or sour cream, at room temp." },
        { "name": "1.5 cups (345g, ~3–4 large ripe) mashed bananas" },
        { "name": "1 tsp vanilla paste" },
        { "name": "(optional) 3/4 cup (100g) chopped pecans" }
      ]
    }
  ],
  "equipment": [
    { "name": "9x5 loaf pan" },
    { "name": "handheld or stand mixer" },
    { "name": "glass mixing bowls" },
    { "name": "whisk" },
    { "name": "silicone spatula" },
    { "name": "cooling rack " }
  ],
  "stepSections": [
    {
      "steps": [
        { "text": "Adjust the oven rack to the lower third position and preheat the oven to 350°F (177°C). Lowering the oven rack prevents the top of your bread from browning too much, too soon. Grease a metal 9×5-inch loaf pan with nonstick spray. Set aside." },
        { "text": "Whisk the flour, baking soda, salt, and cinnamon together in a medium bowl. Set aside." },
        { "text": "Using a handheld or stand mixer fitted with a paddle or whisk attachment, beat the butter and brown sugar together on high speed until smooth and creamy, about 2 minutes. With the mixer running on medium speed, add the eggs one at a time, beating well after each addition. Then beat in the yogurt, mashed bananas, and vanilla extract until combined." },
        { "text": "With the mixer running on low speed, slowly beat the dry ingredients into the wet ingredients until no flour pockets remain. Do not over-mix. Fold in the nuts, if using." },
        { "text": "Pour and spread the batter into the prepared baking pan. Bake for 60–65 minutes, making sure to loosely cover the bread with aluminum foil halfway through to prevent the top from getting too brown. The bread is done when a toothpick inserted in the center comes out clean with only a few small moist crumbs. This may be after 60–65 minutes depending on your oven, so begin checking every 5 minutes around the 60-minute mark." },
        { "text": "Remove bread from the oven and allow the bread to cool in the pan set on a wire rack for 1 hour. Remove bread from the pan and cool bread directly on the wire rack until ready to slice and serve." },
        { "text": "Cover and store banana bread at room temperature for 2 days or in the refrigerator for up to 1 week. Banana bread tastes best on day 2 after the flavors have settled together." }
      ]
    }
  ]
}
