{
  "slug": "lemon-bars",
  "name": "Lemon Bars",
  "description": "These lemon bars are a perfect balance of tart and sweet, with a buttery shortbread crust that melts in your mouth. The filling is rich and creamy, made with fresh lemon juice and zest for an authentic citrus flavor. A dusting of powdered sugar on top adds a touch of sweetness and makes these bars look as good as they taste.",
  "credit": "Recipe originally by John Kanell of Preppy Kitchen.",
  "imageUrl": "assets/images/bars/lemon-bars.jpg",
  "categories": ["bars"],
  "flavors": ["citrus", "rich"],
  "occasion": [],
  "prepTime": "20 mins.",
  "cookTime": "55 mins.",
  "chillTime": "3 hours",
  "totalTime": "4 hours 15 mins.",
  "yield": "15 bars",
  "ingredientSections": [
    {
      "items": [
        { "name": "3 cups (360g) all-purpose flour, divided 2 1/2 cups for crust and 1/2 cup for filling" },
        { "name": "2/3 cups (66g) powdered sugar, for the shortbread, plus more for dusting" },
        { "name": "1/2 tsp salt" },
        { "name": "12 tbsp (170g) unsalted butter, melted" },
        { "name": "3 tbsp lemon zest (~3 lemons)" },
        { "name": "3 cups (600g) sugar" },
        { "name": "8 large eggs, room temp." },
        { "name": "1 cup (240mL) lemon juice, fresh" }
      ]
    }
  ],
  "equipment": [
    { "name": "9x13 pan" },
    { "name": "parchment paper" },
    { "name": "food processor" },
    { "name": "silicone spatula" },
    { "name": "whisk" },
    { "name": "rasp grater" },
    { "name": "glass mixing bowls" }
  ],
  "stepSections": [
    {
      "steps": [
        { "text": "Heat oven to 350F and line a 9x13 baking dish with parchment paper." },
        { "text": "Whisk together 2 1/2 cups of flour (300g) with the powdered sugar and salt, then pour in the melted butter and mix until combined. You can also do this using a stand mixer with a paddle attachment. If you'd like a dash of vanilla can be added in with the butter at this step." },
        { "text": "Sprinkle the dough into your lined pan and press down into a flat layer. Bake at 350F for about 20 minutes or until a light golden color." },
        { "text": "While the crust is baking add the sugar to a food processor and add the zest of three lemons. Pulse until the zest is fully incorporated and sugar is a light yellow color. If you don't have a processor just mince the zest and mix with the sugar in a bag or bowl." },
        { "text": "Add the sugar and remaining half cup of flour to a large bowl and mix well. You can sift together however and zesty sugar bits will need to get dumped out of the sifter as they might clog things up and not go through." },
        { "text": "Pour in the lemon juice and add the eggs then mix very well until completely combined." },
        { "text": "Pour the filling onto the warm crust then transfer to oven and bake for about 25 minutes, turning halfway through the bake. Remove from oven and allow to cool for an hour before chilling in the refrigerator for two hours." },
        { "text": "Dust with powdered sugar and cut into bars using a clean, sharp, damp knife. Clean and re-wet the knife after each cut." }
      ]
    }
  ]
}
